# 23 February 2023

In [4]:
import pandas as pd

## Q1

In [10]:
series1 = pd.Series([4, 8, 15, 16, 23, 42])
series1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

## Q2

In [9]:
ls = [1,2,3,4,5,6,7,8,9,10]
series2 = pd.Series(ls)
series2

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

## Q3

In [17]:
dic = {"Name" : ['Alice','Bob','Claire'],
       "Age" : [25,30,27],
       "Gender" : ['Female','Male','Female']}
df1 = pd.DataFrame(dic)
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

## Q4

In pandas, a DataFrame is a two-dimensional labeled data structure with columns of potentially different types. It is similar to a spreadsheet or SQL table. On the other hand, a Series is a one-dimensional labeled array that can contain any data type.

In [19]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 32, 18, 47],
        'Country': ['USA', 'Canada', 'France', 'UK']}
df2 = pd.DataFrame(data)
df2

      Name  Age Country
0    Alice   25     USA
1      Bob   32  Canada
2  Charlie   18  France
3    David   47      UK

In [18]:
data = [1,11, 21, 31, 41, 51]
series3 = pd.Series(data)
series3

0     1
1    11
2    21
3    31
4    41
5    51
dtype: int64

## Q5

1. head() - This function is used to display the first few rows of the DataFrame. It can be used to get an overview of the data and check if it has been loaded correctly. For example, df.head() will return the first five rows of the DataFrame df.

2. describe() - This function provides a statistical summary of the DataFrame, including count, mean, standard deviation, minimum, and maximum values for each column. It can be useful to get an idea of the distribution of the data. For example, df.describe() will return the statistical summary of the DataFrame df.

3. groupby() - This function is used to group data by one or more columns and apply a function to each group. It can be useful to summarize data based on certain criteria. For example, df.groupby('category')['sales'].sum() will group the DataFrame df by the 'category' column and sum the 'sales' column for each group.

4. sort_values() - This function is used to sort the DataFrame by one or more columns. It can be useful to order the data in a meaningful way. For example, df.sort_values('date') will sort the DataFrame df by the 'date' column in ascending order.

5. drop() - This function is used to remove one or more columns or rows from the DataFrame. It can be useful to eliminate unnecessary data. For example, df.drop(['column1', 'column2'], axis=1) will remove the 'column1' and 'column2' columns from the DataFrame df.

6. fillna() - This function is used to fill missing values in the DataFrame with a specified value or method. It can be useful to handle missing data. For example, df.fillna(0) will replace all missing values in the DataFrame df with 0.

## Q6

Series and DataFrame are mutable in nature, whereas Panel is immutable.

## Q7

To create a DataFrame using multiple Series in pandas, we can use the pd.concat() function.

In [22]:
series1 = pd.Series([10, 20, 30, 40])
series2 = pd.Series([50, 60, 70, 80])
df3 = pd.concat([series1, series2], axis=1)
df3

    0   1
0  10  50
1  20  60
2  30  70
3  40  80